---
type: VertexBuffer
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 11
tags: [revit-api, class]
---

# VertexBuffer

`Autodesk.Revit.DB.DirectContext3D.VertexBuffer` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VertexBuffer | 2017 | `public VertexBuffer ( int sizeInFloats )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetMappedHandle | 2017 | `public IntPtr GetMappedHandle ()` |
| Method | GetVertexStreamPosition | 2017 | `public VertexStreamPosition GetVertexStreamPosition ()` |
| Method | GetVertexStreamPositionColored | 2017 | `public VertexStreamPositionColored GetVertexStreamPositionColored ()` |
| Method | GetVertexStreamPositionNormal | 2017 | `public VertexStreamPositionNormal GetVertexStreamPositionNormal ()` |
| Method | GetVertexStreamPositionNormalColored | 2017 | `public VertexStreamPositionNormalColored GetVertexStreamPositionNormalColored ()` |
| Method | IsValid | 2017 | `public bool IsValid ()` |
| Method | Map | 2017 | `public void Map ( int sizeInFloats )` |
| Method | Unmap | 2017 | `public void Unmap ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |